# Data analysis with pandas

In [81]:
#import the libraries
import pandas as pd

In [82]:
#create a dictionary to create dataframe
df={
    "Name":["Snehal","Vishal","Suraj","Meenu","Samiksha","Nikkita","Sanket"],
    "Age":[26,25,31,23,26,26,25],
    "Marks":[89,90,98,78,99,93,82],
    "Gender":["F","M","M","F","F","F","M"]
}

In [83]:

#convert dictionary to data frame 
data=pd.DataFrame(df)
data

       Name  Age  Marks Gender
0    Snehal   26     89      F
1    Vishal   25     90      M
2     Suraj   31     98      M
3     Meenu   23     78      F
4  Samiksha   26     99      F
5   Nikkita   26     93      F
6    Sanket   25     82      M

1. Display first 3 columns from the dataset

In [84]:
data.head(3)

     Name  Age  Marks Gender
0  Snehal   26     89      F
1  Vishal   25     90      M
2   Suraj   31     98      M

2. Display last 3 data columns from dataset

In [85]:
data.tail(3)

       Name  Age  Marks Gender
4  Samiksha   26     99      F
5   Nikkita   26     93      F
6    Sanket   25     82      M

3. Find shape of dataset

In [86]:
data.shape

(7, 4)

4. Get meta data of dataset(number of rows,columns, datatype etc)

In [87]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Marks   7 non-null      int64
 3   Gender  7 non-null      object
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

5. Check null values in the dataset

In [88]:
data.isnull().sum(axis=0)#null values column vise

Name      0
Age       0
Marks     0
Gender    0
dtype: int64

In [89]:
data.isnull().sum(axis=1)#null value row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

6. Get overall stats of dataset

In [90]:
data.describe()

            Age      Marks
count   7.00000   7.000000
mean   26.00000  89.857143
std     2.44949   7.776644
min    23.00000  78.000000
25%    25.00000  85.500000
50%    26.00000  90.000000
75%    26.00000  95.500000
max    31.00000  99.000000

7. Find unique values from gender column

In [91]:
data['Gender'].unique()

array(['F', 'M'], dtype=object)

8. find the number of unique values in gender column

In [92]:
data['Gender'].nunique()

2

9. count of unique values in gender column

In [93]:
data['Gender'].value_counts()

Gender
F    4
M    3
Name: count, dtype: int64

10. Find the number of students having marks between 90 to 100

In [94]:
#with the help of data manipulation
len(data[(data["Marks"]>=90) &  (data["Marks"]<=100)])

4

In [95]:
#using between
sum(data["Marks"].between(90,100))

4

11. Find average marks

In [96]:
#using formula
def func(x):
    return x.sum()/x.count()
    
func(data["Marks"])

89.85714285714286

In [97]:
#usinf mean formula
data["Marks"].mean()

89.85714285714286

12. Create a new column with male as 1 and female as 0 notation using map function(Encoding )

In [98]:
data["Gender_symbol"]=data["Gender"].map({"M":1,"F":0})

In [99]:
data.head(3)

     Name  Age  Marks Gender  Gender_symbol
0  Snehal   26     89      F              0
1  Vishal   25     90      M              1
2   Suraj   31     98      M              1

13. Drop the columns not in use

In [100]:
data.drop(columns=["Gender"],inplace=True)

14. Print name of the columns

In [101]:
data.columns

Index(['Name', 'Age', 'Marks', 'Gender_symbol'], dtype='object')

15. Sort the dataframe as per marks values

In [102]:
data.sort_values(by=["Marks","Age"],ascending=False)

       Name  Age  Marks  Gender_symbol
4  Samiksha   26     99              0
2     Suraj   31     98              1
5   Nikkita   26     93              0
1    Vishal   25     90              1
0    Snehal   26     89              0
6    Sanket   25     82              1
3     Meenu   23     78              0

16. Display name and marks of female students

In [109]:
data[data["Gender_symbol"]==0][["Name","Marks"]]

       Name  Marks
0    Snehal     89
3     Meenu     78
4  Samiksha     99
5   Nikkita     93

In [112]:
data[data["Gender_symbol"].isin([0])][["Name","Marks"]]

       Name  Marks
0    Snehal     89
3     Meenu     78
4  Samiksha     99
5   Nikkita     93